export const form2Structure = [
  {
    code: "2000",
    label: "Чистий дохід від реалізації продукції (товарів, робіт, послуг)",
  },
  {
    code: "2050",
    label: "Собівартість реалізованої продукції (товарів, робіт, послуг)",
  },
  { code: "2090", label: "Валовий: прибуток", isCalculated: true },
  { code: "2095", label: "Валовий: збиток", isCalculated: true },
  { code: "2120", label: "Інші операційні доходи" },
  { code: "2130", label: "Адміністративні витрати" },
  { code: "2150", label: "Витрати на збут" },
  { code: "2180", label: "Інші операційні витрати" },
  {
    code: "2190",
    label: "Фінансовий результат від операційної діяльності: прибуток",
    isCalculated: true,
  },
  {
    code: "2195",
    label: "Фінансовий результат від операційної діяльності: збиток",
    isCalculated: true,
  },
  { code: "2200", label: "Дохід від участі в капіталі" },
  { code: "2220", label: "Інші фінансові доходи" },
  { code: "2240", label: "Інші доходи" },
  { code: "2250", label: "Фінансові витрати" },
  { code: "2255", label: "Втрати від участі в капіталі" },
  { code: "2270", label: "Інші витрати" },
  {
    code: "2290",
    label: "Фінансовий результат до оподаткування: прибуток",
    isCalculated: true,
  },
  {
    code: "2295",
    label: "Фінансовий результат до оподаткування: збиток",
    isCalculated: true,
  },
  { code: "2300", label: "Витрати (дохід) з податку на прибуток" },
  {
    code: "2305",
    label: "Прибуток (збиток) від припиненої діяльності після оподаткування",
  },
  {
    code: "2350",
    label: "Чистий фінансовий результат: прибуток",
    isCalculated: true,
    isUsedInIndicators: true,
  },
  {
    code: "2355",
    label: "Чистий фінансовий результат: збиток",
    isCalculated: true,
  },

  { code: "2400", label: "Дооцінка (уцінка) необоротних активів" },
  { code: "2405", label: "Дооцінка (уцінка) фінансових інструментів" },
  { code: "2410", label: "Накопичені курсові різниці" },
  {
    code: "2415",
    label:
      "Частка іншого сукупного доходу асоційованих та спільних підприємств",
  },
  { code: "2445", label: "Інший сукупний дохід" },
  {
    code: "2450",
    label: "Інший сукупний дохід до оподаткування",
    isCalculated: true,
  },
  {
    code: "2455",
    label: "Податок на прибуток, пов’язаний з іншим сукупним доходом",
  },
  {
    code: "2460",
    label: "Інший сукупний дохід після оподаткування",
    isCalculated: true,
  },
  {
    code: "2465",
    label: "Сукупний дохід (сума рядків 2350, 2355 та 2460)",
    isCalculated: true,
  },

  { code: "2500", label: "Матеріальні затрати", isUsedInIndicators: true },
  { code: "2505", label: "Витрати на оплату праці", isUsedInIndicators: true },
  {
    code: "2510",
    label: "Відрахування на соціальні заходи",
    isUsedInIndicators: true,
  },
  { code: "2515", label: "Амортизація", isUsedInIndicators: true },
  { code: "2520", label: "Інші операційні витрати", isUsedInIndicators: true },
  {
    code: "2550",
    label: "Разом",
    isCalculated: true,
    isUsedInIndicators: true,
  },

  { code: "2600", label: "Середньорічна кількість простих акцій" },
  { code: "2605", label: "Скоригована середньорічна кількість простих акцій" },
  { code: "2610", label: "Чистий прибуток (збиток) на одну просту акцію" },
  {
    code: "2615",
    label: "Скоригований чистий прибуток (збиток) на одну просту акцію",
  },
  { code: "2650", label: "Дивіденди на одну просту акцію" },
];
